{
  "projects": {
    "personal_projects": [
      {
        "name": "Personal Portfolio Website",
        "Project_Overview": "Un portafolio personal enfocado en mostrar proyectos y habilidades técnicas de manera interactiva y responsiva.",
        "description": "Desarrollo de un portafolio moderno utilizando React y Tailwind CSS, con animaciones en Framer Motion. Permite a los visitantes explorar proyectos, revisar detalles técnicos y contactar a través de formularios integrados.",
        "role": "Sole Developer",
        "technologies": {
          "Frontend": ["React", "Tailwind CSS", "Framer Motion", "HTML", "CSS"],
          "Design": ["Figma"],
          "Deployment": ["GitHub Pages"]
        },
        "start_date": "2024-01-01",
        "end_date": "2024-02-20",
        "responsibilities": [
          "Diseñar la arquitectura de componentes y el flujo de navegación.",
          "Implementar un diseño responsivo para distintos tamaños de pantalla.",
          "Integrar animaciones suaves con Framer Motion para destacar secciones clave."
        ],
        "achievements": [
          "Incremento en la visibilidad de proyectos personales, recibiendo feedback de reclutadores.",
          "La estructura modular permitió realizar futuras actualizaciones de contenido sin complicaciones.",
          "Diseño completamente responsivo con excelente rendimiento en dispositivos móviles."
        ],
        "client": "Personal",
        "team_size": 1,
        "url": "https://darinelescobar.github.io/",
        "repository": "https://github.com/DarinelEscobar/DarinelEscobar.github.io.git",
        "media": [
          {
            "type": "image",
            "description": "Sección principal del portafolio con un diseño moderno.",
            "url": "assets/images/Portafolio/Portafolio.png"
          }
        ]
      },
      {
        "name": "ChatGPT-SmartNavbar",
        "Project_Overview": "Extensión de Chrome diseñada para acelerar el flujo de trabajo en ChatGPT, ofreciendo atajos y una administración inteligente de prompts.",
        "description": "La extensión añade un menú de navegación intuitivo y dinámico en la interfaz de ChatGPT, permitiendo la búsqueda y organización de prompts, así como la creación de categorías personalizadas para facilitar la gestión de plantillas y mensajes frecuentes.",
        "role": "Frontend Developer",
        "technologies": {
          "Browser Extension": ["JavaScript", "Chrome APIs"],
          "Styling": ["Tailwind CSS", "Bootstrap (opcional)"],
          "Tools": ["npm", "Webpack", "Postman"]
        },
        "start_date": "2024-03-01",
        "end_date": "2024-04-15",
        "responsibilities": [
          "Desarrollar la interfaz principal de la extensión con JavaScript y Tailwind CSS.",
          "Configurar scripts de build y empaquetado para la extensión en Chrome.",
          "Implementar funcionalidades de autocompletado y organización de prompts en múltiples categorías.",
          "Optimizar el rendimiento mediante la observación del DOM y la actualización dinámica del contenido."
        ],
        "achievements": [
          "Mejoró significativamente la productividad de usuarios que utilizan ChatGPT de forma intensiva.",
          "Implementación de un sistema de búsqueda flexible que soporta palabras incompletas o múltiples fragmentos.",
          "Nueva funcionalidad de autoguardado de preferencias del usuario, facilitando el uso continuo."
        ],
        "client": "Proyecto Personal",
        "team_size": 1,
        "url": "N/A",
        "repository": "https://github.com/DarinelEscobar/ChatGPT-SmartNavbar.git",
        "media": [
          {
            "type": "image",
            "description": "Vista principal de la extensión mostrando la barra de navegación inteligente.",
            "url": "assets/images/Sample.png"
          }
        ]
      }
    ]
  }
}
